Rails/music_app/app/views/notes/_note.html.erb

<ul>
<% track.notes.each do |note|%>
---
SELECT "notes".* FROM "notes" WHERE "notes"."track_id" = $1  [["track_id", 21]]