Rails/cats99/app/views/cat_rental_requests/index.html.erb

SELECT "cats".* FROM "cats"
---
    <option value="" selected disabled>--select a cat--</option>
    <%Cat.all.each do |kitten| %>