Rails/FirstProject/FirstProject/app/controllers/artwork_shares_controller.rb

DELETE FROM "artwork_shares" WHERE "artwork_shares"."id" = $1  [["id", 9]]
---
    def destroy
        artwork_share = ArtworkShare.destroy(params[:id])