Rails/FirstProject/FirstProject/app/controllers/artworks_controller.rb

    def index
        render json: Artwork.find(params[:user_id])
---
SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    def create
        artwork = Artwork.new(user_params)
        if artwork.save
---
INSERT INTO "artworks" ("title", "image_url", "artist_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Never Nude Blue"], ["image_url", "www.blueman.com"], ["artist_id", 12], ["created_at", "2020-04-20 23:16:41.517325"], ["updated_at", "2020-04-20 23:16:41.517325"]]

    def update
        artwork = Artwork.find(params[:id])
        artwork.update!(user_params)
---
SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
UPDATE "artworks" SET "image_url" = $1, "updated_at" = $2 WHERE "artworks"."id" = $3  [["image_url", "www.monetlillies.com"], ["updated_at", "2020-04-19 22:13:28.641320"], ["id", 7]]

    def destroy
        artwork = Artwork.destroy(params[:id])
---
DELETE FROM "artworks" WHERE "artworks"."id" = $1  [["id", 7]]