Rails/FirstProject/FirstProject/app/controllers/comments_controller.rb

SELECT "comments".* FROM "comments" WHERE "comments"."user_id" = $1  [["user_id", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."artwork_id" = $1  [["artwork_id", 3]]
SELECT "comments".* FROM "comments"
---
    def index
        if params[:comment][:user_id]
            comments = Comment.where(user_id: params[:comment][:user_id])
            render json: comments
        elsif
            params[:comment][:artwork_id]
            comments = Comment.where(artwork_id: params[:comment][:artwork_id])
            render json: comments
        else
            render json: Comment.all

INSERT INTO "comments" ("user_id", "artwork_id", "text", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 1], ["artwork_id", 3], ["text", "I love elephants!"], ["created_at", "2020-04-20 23:33:22.558973"], ["updated_at", "2020-04-20 23:33:22.558973"]]
---
    def create
        comment = Comment.new(comment_params)
        if comment.save

DELETE FROM "comments" WHERE "comments"."id" = $1  [["id", 3]]
---
    def destroy
        comment = Comment.destroy(params[:id])