Rails/FirstProject/FirstProject/app/controllers/comments_controller.rb

    def index
        # if params.dig(:comment,:user_id).nil? == false
        #     comments = Comment.where(user_id: params[:comment][:user_id])
        #     render json: comments
        # elsif
        #     params.dig(:comment,:artwork_id).nil? == false
        #     comments = Comment.where(artwork_id: params[:comment][:artwork_id])
        #     render json: comments
        # else
        #     render json: Comment.all
        # end
        case
        when params[:user_id]
            comments = Comment.where(user_id: params[:user_id])
---
SELECT "comments".* FROM "comments" WHERE "comments"."user_id" = $1  [["user_id", 1]]