Rails/FirstProject/FirstProject/app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def show
        #user = User.find(params[id])
        render json: User.find(params[:id])

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
UPDATE "users" SET "email" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["email", "rock@rockmartino.com"], ["updated_at", "2020-04-12 23:33:47.023661"], ["id", 4]]
---
    def update
        user = User.find(params[:id])
        user.update!(user_params)

DELETE FROM "users" WHERE "users"."id" = $1  [["id", 4]]
---
    def destroy
        User.destroy(params[:id])