Rails/music_app/app/controllers/albums_controller.rb

    def new
        @band = Band.find_by(id: params[:band_id])
---
SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]

    def create
        @album = Album.new(album_params)
        if @album.save
---
INSERT INTO "albums" ("name", "band_id", "year", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Lights"], ["band_id", 8], ["year", 2010], ["created_at", "2020-06-04 22:04:22.714008"], ["updated_at", "2020-06-04 22:04:22.714008"]]

    def edit
        @album = Album.find_by(id: params[:id])
        @band = Band.find_by(id: @album.band_id)
---
SELECT  "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]
SELECT  "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]

    def update
        @album = Album.find_by(id: params[:id])
        if @album.update_attributes(album_params)
---
SELECT  "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
UPDATE "albums" SET "name" = $1, "updated_at" = $2 WHERE "albums"."id" = $3  [["name", "little lion man v2"], ["updated_at", "2020-06-04 22:20:20.732276"], ["id", 4]]

    def destroy
        @album = Album.find_by(id: params[:id])
        @album.destroy
---
SELECT  "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]
DELETE FROM "albums" WHERE "albums"."id" = $1  [["id", 9]]