Rails/music_app/app/controllers/bands_controller.rb

INSERT INTO "bands" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Tim McGraw"], ["created_at", "2020-05-28 21:32:19.613912"], ["updated_at", "2020-05-28 21:32:19.613912"]]
---
    def create
        #TODO update the views for band:create
        @band = Band.new(band_params)
        if @band.save

SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
    def edit
        #TODO update the band:edit
        @band = Band.find_by(id: params[:id])

SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "bands" SET "name" = $1, "updated_at" = $2 WHERE "bands"."id" = $3  [["name", "Jim McGraw"], ["updated_at", "2020-05-31 21:09:16.266176"], ["id", 2]]
---
    def update
        @band = Band.find_by(id: [params[:id]])
        if @band.update_attributes(band_params)