Rails/music_app/app/controllers/notes_controller.rb

def create
    @user = User.find_by(session_token: session[:session_token])
    @note = Note.new(user_id: @user.id, track_id: params[:note][:track_id],text:params[:note][:text])
    @note.save
---
SELECT  "users".* FROM "users" WHERE "users"."session_token" = $1 LIMIT $2  [["session_token", "PTzJS_1PbXbR1kZaaFHzlg"], ["LIMIT", 1]]
INSERT INTO "notes" ("user_id", "track_id", "text", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 11], ["track_id", 21], ["text", "I like this song"], ["created_at", "2020-06-14 21:44:00.850587"], ["updated_at", "2020-06-14 21:44:00.850587"]]

def destroy
    @note = Note.find_by(id: params[:id])
    if session[:session_token] == @note.user.session_token
        @note.destroy
---
SELECT  "notes".* FROM "notes" WHERE "notes"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
DELETE FROM "notes" WHERE "notes"."id" = $1  [["id", 2]]