Rails/music_app/app/controllers/tracks_controller.rb

    def create
        #post request for the new track
        @track = Track.new(track_params)
        if @track.save
---
INSERT INTO "tracks" ("album_id", "ord", "name", "bonus?", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["album_id", "11"], ["ord", 4], ["name", "We belong together"], ["bonus?", false], ["created_at", "2020-06-10 22:39:57.268549"], ["updated_at", "2020-06-10 22:39:57.268549"]]

    def edit
        #page to edit a track
        @track = Track.find_by(id: params[:id])
        @album = Album.find_by(id: @track.album_id)
---
SELECT  "tracks".* FROM "tracks" WHERE "tracks"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]
SELECT  "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]

    def show
        #shows a specific track
        @track = Track.find_by(id: params[:id])
---
SELECT  "tracks".* FROM "tracks" WHERE "tracks"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]

    def update
        #request to update a track
        @track = Track.find_by(id: params[:id])
        @album = Album.find_by(id: @track.album_id)
        if @track.update_attributes(track_params)
---
SELECT  "tracks".* FROM "tracks" WHERE "tracks"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
SELECT  "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]
UPDATE "tracks" SET "name" = $1, "updated_at" = $2 WHERE "tracks"."id" = $3  [["name", "Tswifty_rulez"], ["updated_at", "2020-06-08 23:00:44.671080"], ["id", 7]]

    def destroy
        #destroy the track
        @track = Track.find_by(id: params[:id])
        @track.destroy
---
SELECT  "tracks".* FROM "tracks" WHERE "tracks"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
DELETE FROM "tracks" WHERE "tracks"."id" = $1  [["id", 6]]