Rails/cats99/app/models/cat_rental_request.rb

SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
UPDATE "cat_rental_requests" SET "status" = $1, "updated_at" = $2 WHERE "cat_rental_requests"."id" = $3  [["status", "APPROVED"], ["updated_at", "2020-05-05 22:32:36.256549"], ["id", 10]]
---
    def approve!

        ActiveRecord::Base.transaction do
            self.status = 'APPROVED'
            to_deny = overlapping_pending_requests.where("id != ?", self.id)
            to_deny.each do |deny|
                deny.status = 'DENIED'
                deny.save!
            end
            self.save!

UPDATE "cat_rental_requests" SET "status" = $1, "updated_at" = $2 WHERE "cat_rental_requests"."id" = $3  [["status", "DENIED"], ["updated_at", "2020-05-05 22:44:47.895167"], ["id", 10]]
---
    def deny!
        self.status = 'DENIED'
        self.save