Rails/cats99/app/controllers/cat_rental_requests_controller.rb

INSERT INTO "cat_rental_requests" ("cat_id", "start_date", "end_date", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["cat_id", 5], ["start_date", "2020-05-04"], ["end_date", "2020-05-06"], ["created_at", "2020-05-04 02:02:43.935571"], ["updated_at", "2020-05-04 02:02:43.935571"]]
---
    def create
        @cat_rental_request = CatRentalRequest.new(cat_rental_request_params)

        if @cat_rental_request.save

SELECT  "cat_rental_requests".* FROM "cat_rental_requests" WHERE "cat_rental_requests"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]
---
    def approve
        @cat_rental_request = CatRentalRequest.find_by(id: params[id])

SELECT  "cat_rental_requests".* FROM "cat_rental_requests" WHERE "cat_rental_requests"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]
---
    def deny
        @cat_rental_request = CatRentalRequest.find_by(id: params[id])