Rails/cats99/app/controllers/cats_controller.rb

    def update
        @cat = Cat.find_by(id: params[:id])

            if @cat.update_attributes(cat_params)
---
SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "cats" SET "description" = $1, "updated_at" = $2 WHERE "cats"."id" = $3  [["description", "such a cutie! (edited with form)"], ["updated_at", "2020-04-29 23:41:44.420986"], ["id", 3]]