Rails/music_app/app/views/albums/new.html.erb


<% Band.all each do |band| %>
---
SELECT "bands".* FROM "bands"