Rails/music_app/app/views/tracks/_form.html.erb

<select name="track[album_id]" id="track_album">
<% Album.all.each do |album| %>
---
SELECT "albums".* FROM "albums"